In [1]:
import datetime
a = datetime.date(2016,7,25)
print(a)

2016-07-25

In [2]:
tday = datetime.date.today()
print(tday)

2020-09-03

In [3]:
print(tday.month)
print(tday.day)

9
3

In [4]:
tdelta = datetime.timedelta(days=7)
print(tdelta)

7 days, 0:00:00

In [5]:
print(tday + tdelta)

2020-09-10

In [6]:
mybday = datetime.date(2020,7,18)

In [7]:
diff = tday - mybday
print(diff)

47 days, 0:00:00

In [8]:
t = datetime.datetime.now()
print(t)

2020-09-03 18:52:35.872962

In [9]:
time = datetime.time(10,35,46,1234)
print(time)

10:35:46.001234

In [10]:
dttime = datetime.datetime.now()
dttime

datetime.datetime(2020, 9, 3, 18, 52, 40, 135268)

In [11]:
mydate = datetime.datetime(2020,7,18,12,34)
print(mydate)
print(mydate.year)
print(mydate.day)

2020-07-18 12:34:00
2020
18

In [12]:
delt = datetime.timedelta(hours = 12)

In [13]:
print(mydate+delt)

2020-07-19 00:34:00

In [14]:
a = datetime.datetime.today()
b = datetime.datetime.now()
c = datetime.datetime.utcnow()
print(a)
print(b)
print(c)

2020-09-03 18:52:50.356804
2020-09-03 18:52:50.356803
2020-09-03 13:22:50.356803

In [16]:
#####lets start ordinal encoding
today = datetime.datetime.today()
today

datetime.datetime(2020, 9, 3, 18, 53, 36, 172211)

In [18]:
today - datetime.timedelta(1)

datetime.datetime(2020, 9, 2, 18, 53, 36, 172211)

In [20]:
days = [today - datetime.timedelta(x) for x in range(0,15)]
days

[datetime.datetime(2020, 9, 3, 18, 53, 36, 172211),
 datetime.datetime(2020, 9, 2, 18, 53, 36, 172211),
 datetime.datetime(2020, 9, 1, 18, 53, 36, 172211),
 datetime.datetime(2020, 8, 31, 18, 53, 36, 172211),
 datetime.datetime(2020, 8, 30, 18, 53, 36, 172211),
 datetime.datetime(2020, 8, 29, 18, 53, 36, 172211),
 datetime.datetime(2020, 8, 28, 18, 53, 36, 172211),
 datetime.datetime(2020, 8, 27, 18, 53, 36, 172211),
 datetime.datetime(2020, 8, 26, 18, 53, 36, 172211),
 datetime.datetime(2020, 8, 25, 18, 53, 36, 172211),
 datetime.datetime(2020, 8, 24, 18, 53, 36, 172211),
 datetime.datetime(2020, 8, 23, 18, 53, 36, 172211),
 datetime.datetime(2020, 8, 22, 18, 53, 36, 172211),
 datetime.datetime(2020, 8, 21, 18, 53, 36, 172211),
 datetime.datetime(2020, 8, 20, 18, 53, 36, 172211)]

In [24]:
import pandas as pd
df = pd.DataFrame(days)
df.columns=["day"]
df.head()

                         day
0 2020-09-03 18:53:36.172211
1 2020-09-02 18:53:36.172211
2 2020-09-01 18:53:36.172211
3 2020-08-31 18:53:36.172211
4 2020-08-30 18:53:36.172211

In [41]:
df1 = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
df1.head(10)

   0                  1       2           3   4   ...     10 11  12              13      14
0  39          State-gov   77516   Bachelors  13  ...   2174  0  40   United-States   <=50K
1  50   Self-emp-not-inc   83311   Bachelors  13  ...      0  0  13   United-States   <=50K
2  38            Private  215646     HS-grad   9  ...      0  0  40   United-States   <=50K
3  53            Private  234721        11th   7  ...      0  0  40   United-States   <=50K
4  28            Private  338409   Bachelors  13  ...      0  0  40            Cuba   <=50K
5  37            Private  284582     Masters  14  ...      0  0  40   United-States   <=50K
6  49            Private  160187         9th   5  ...      0  0  16         Jamaica   <=50K
7  52   Self-emp-not-inc  209642     HS-grad   9  ...      0  0  45   United-States    >50K
8  31            Private   45781     Masters  14  ...  14084  0  50   United-States    >50K
9  42            Private  159449   Bachelors  13  ...   5178  0  40   United-States    >50K

[10 rows x 15 columns]

In [42]:
columns = [1,3,5,6,7,8,9,13]

In [43]:
df1 = df1[columns]
df1.head()

                  1           3                    5   ...      8        9               13
0          State-gov   Bachelors        Never-married  ...   White     Male   United-States
1   Self-emp-not-inc   Bachelors   Married-civ-spouse  ...   White     Male   United-States
2            Private     HS-grad             Divorced  ...   White     Male   United-States
3            Private        11th   Married-civ-spouse  ...   Black     Male   United-States
4            Private   Bachelors   Married-civ-spouse  ...   Black   Female            Cuba

[5 rows x 8 columns]

In [44]:
df1.columns = ['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [45]:
df1.head()

          Employment      Degree               Status  ...    Race      Sex         Country
0          State-gov   Bachelors        Never-married  ...   White     Male   United-States
1   Self-emp-not-inc   Bachelors   Married-civ-spouse  ...   White     Male   United-States
2            Private     HS-grad             Divorced  ...   White     Male   United-States
3            Private        11th   Married-civ-spouse  ...   Black     Male   United-States
4            Private   Bachelors   Married-civ-spouse  ...   Black   Female            Cuba

[5 rows x 8 columns]

In [48]:
for feature in df1.columns:
    print(feature,"has",len(df1[feature].unique()),"labels")

Employment has 9 labels
Degree has 16 labels
Status has 7 labels
Designation has 15 labels
family_job has 6 labels
Race has 5 labels
Sex has 2 labels
Country has 42 labels

In [53]:
country_map = df1["Country"].value_counts().to_dict()

In [54]:
df1["Country"] = df1["Country"].map(country_map)

In [55]:
df1.head()

          Employment      Degree               Status         Designation      family_job    Race      Sex  Country
0          State-gov   Bachelors        Never-married        Adm-clerical   Not-in-family   White     Male    29170
1   Self-emp-not-inc   Bachelors   Married-civ-spouse     Exec-managerial         Husband   White     Male    29170
2            Private     HS-grad             Divorced   Handlers-cleaners   Not-in-family   White     Male    29170
3            Private        11th   Married-civ-spouse   Handlers-cleaners         Husband   Black     Male    29170
4            Private   Bachelors   Married-civ-spouse      Prof-specialty            Wife   Black   Female       95

<font size=5>target guided ordinal encoding

In [56]:
import pandas as pd
import numpy as np

In [57]:
df2 = pd.read_csv("Titanic.csv",usecols=["Survived","Cabin"])
df2.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [58]:
df2.Cabin.fillna("Missing",inplace=True)

In [59]:
df2.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [60]:
df2["Cabin"] = df2["Cabin"].astype(str).str[0]

In [61]:
df2.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [64]:
df2.groupby(["Cabin"])["Survived"].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [65]:
values = df2.groupby(["Cabin"])["Survived"].mean().sort_values().index

In [66]:
values

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [69]:
values1 = {i:k for k,i in enumerate(values,0)}
values1

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [70]:
df2["label_cabin"] = df2["Cabin"].map(values1)

In [71]:
df2.head()

   Survived Cabin  label_cabin
0         0     M            1
1         1     C            4
2         1     M            1
3         1     C            4
4         0     M            1

<font size=5>mean encoding

In [74]:
df2.groupby("Cabin")["Survived"].mean().to_dict()

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [75]:
df2["Cabin"] = df2["Cabin"].map(df2.groupby("Cabin")["Survived"].mean().to_dict())

In [76]:
df2.head()

   Survived     Cabin  label_cabin
0         0  0.299854            1
1         1  0.593220            4
2         1  0.299854            1
3         1  0.593220            4
4         0  0.299854            1

<font size=5>probability ratio encoding

In [1]:
import numpy as np
import pandas as pd

In [4]:
df3 = pd.read_csv("Titanic.csv",usecols=['Cabin','Survived'])
df3.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [6]:
df3["Cabin"].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [11]:
df3["Cabin"].fillna("missing",inplace=True)

In [12]:
df3["Cabin"] = df3["Cabin"].astype(str).str[0]

In [13]:
df3.head()

   Survived Cabin
0         0     m
1         1     C
2         1     m
3         1     C
4         0     m

In [14]:
df3["Cabin"].unique()

array(['m', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [17]:
probability = df3.groupby(["Cabin"])["Survived"].mean()
probability

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
T    0.000000
m    0.299854
Name: Survived, dtype: float64

In [18]:
type(probability)

pandas.core.series.Series

In [20]:
df4 = pd.DataFrame(probability)
df4.head()

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000

In [21]:
df4["Died"] = 1 - df4["Survived"]

In [22]:
df4.head()

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In [23]:
df4["probability"] = df4["Survived"]/df4["Died"]

In [24]:
df4.head()

       Survived      Died  probability
Cabin
A      0.466667  0.533333     0.875000
B      0.744681  0.255319     2.916667
C      0.593220  0.406780     1.458333
D      0.757576  0.242424     3.125000
E      0.750000  0.250000     3.000000

In [26]:
values = df4["probability"].to_dict()
values

{'A': 0.875,
 'B': 2.916666666666666,
 'C': 1.4583333333333333,
 'D': 3.125,
 'E': 3.0,
 'F': 1.6000000000000003,
 'G': 1.0,
 'T': 0.0,
 'm': 0.42827442827442824}

In [28]:
df3["encoded"] = df3["Cabin"].map(values)

In [29]:
df3.head()

   Survived Cabin   encoded
0         0     m  0.428274
1         1     C  1.458333
2         1     m  0.428274
3         1     C  1.458333
4         0     m  0.428274

In [52]:
a = [1,2,3,4]
func = lambda x:x*x
print(func(5))

25

In [59]:
b = print(list(filter(lambda x:x*x==4,a)))

[2]